

questions = [
            {
                "question": "Что такое Python, и для чего он чаще всего используется?\n ---------------------------- 1. Python - это новый вид языка программирования, разработанный для управления роботами и дронами. \n---------------------------- 2. Python - это название фреймворка для создания 3D-анимации и визуализации данных в виртуальной реальности. ----------------------------  3. Python - это набор библиотек для создания музыкальных композиций и звуковых эффектов. ---------------------------- 4. Python - это интерпретируемый язык программирования, часто используемый для веб-разработки, научных вычислений, анализа данных и автоматизации задач.",
                "options": ["1", "2", "3", "4"],
                "correct_option": 3,
                "fact_text": "Правильный ответ: Python - это интерпретируемый язык программирования, часто используемый для веб-разработки, научных вычислений, анализа данных и автоматизации задач."
            },
            {
                "question": "Какое утверждение про список (list) верно? ---------------------------- 1.  Список (list) - Упорядоченная последовательность изменяемых элементов. ---------------------------- 2. Список (list) - это структура данных для хранения только числовых значений. ---------------------------- 3. Список (list) - это функция в Python для создания рандомизированных списков элементов. ---------------------------- 4. Список (list) - это неупорядоченная последовательность неизменяемых элементов.  ",
                "options": ["1", "2", "3", "4"],
                "correct_option": 0,
                "fact_text": "Правильный ответ: Список (list) - Упорядоченная последовательность изменяемых элементов."
            },
            {
                "question": "Что такое виртуальное окружение (virtual environment) в проекте python? ---------------------------- 1. Это специальный тип оконного интерфейса для работы с виртуальными мирами в Python. ---------------------------- 2. Это программа для виртуализации оборудования для запуска ваших проектов Python. ---------------------------- 3. Это набор инструментов для создания виртуальной реальности в Python. ---------------------------- 4. Это изолированное пространство для проекта Python, где можно управлять зависимостями и версиями библиотек  ",
                "options": ["1", "2", "3", "4"],
                "correct_option": 3,
                "fact_text": 'Правильный ответ: Виртуальное окружение (virtual environment) в проекте python - это изолированное пространство для проекта Python, где можно управлять зависимостями и версиями библиотек'
            },
            {
                "question": "Что такое срез? ---------------------------- 1. Срез — это методика, которая позволяет получить часть списка, кортежа или строки. ---------------------------- 2. Срез - это функция Python для создания копии списка с измененным порядком элементов. ---------------------------- 3. Срез - это специальный метод в Python для добавления новых элементов в середину списка. ---------------------------- 4. Срез - это оператор в Python, используемый для создания переменных, которые являются копиями других переменных. ",
                "options": ["1", "2", "3", "4"],
                "correct_option": 0,
                "fact_text": 'Правильный ответ: Срез — это методика, которая позволяет получить часть списка, кортежа или строки.'
            },
            {
                "question": "Как пишутся комментарии в питоне? ---------------------------- 1. Комментарии в питоне пишутся с помощью символа $. ---------------------------- 2. Комментарии в питоне пишутся с помощью символа #  ---------------------------- 3. Комментарии в питоне пишутся с помощью символа !.  ---------------------------- 4. Комментарии в питоне пишутся с помощью символа /.",
                "options": ["1", "2", "3", "4"],
                "correct_option": 1,
                "fact_text": 'Правильный ответ: Комментарии в питоне пишутся с помощью символа #'
            },
        ]