

questions = [
            {
                "question": "Какова основная функция Django?",
                "options": ["Создание дизайна веб-приложений", "Управление базами данных", 
                            """Предоставление среды для 
    разработки веб-приложений""", """Оптимизация 
производительности сервера"""],
                "correct_option": 2,
                "fact_text": "Правильный ответ: Предоставление среды для разработки веб-приложений"
            },
            {
                "question": "Откуда взялось название Django?",
                "options": ["""В честь фильма 
'Джанго Освобождённый' """, """В честь джазового 
музыканта Джанго Рейнхардта.""", """Составленные вместе инициалы 
первых разработчиков фреймворка.""", """Случайный набор букв"""],
                "correct_option": 1,
                "fact_text": "Правильный ответ: В честь джазового музыканта Джанго Рейнхардта."
            },
            {
                "question": "Какой командой создаётся Django-проект?",
                "options": ["""django-admin 
startproject название""", "django-start название", """django new название""", """create-django-project название"""],
                "correct_option": 0,
                "fact_text": "Правильный ответ: Django-проект создаётся командой django-admin startproject название_проекта"
            },
            {
                "question": "Какой командой запускается встроенный веб-сервер?",
                "options": ["""python manage.py runserver""", "python manage.py startserver", """python server.py""", """python django run.py"""],
                "correct_option": 0,
                "fact_text": "Правильный ответ: встроенный веб-сервер запускается командой python manage.py runserver"
            },
            {
                "question": "Что такое Django ORM и какую функцию оно выполняет?",
                "options": [
"""Инструмент для создания 
пользовательского интерфейса в Django""", 
"""Система автоматического
тестирования в Django""", 
""" "Переводчик" запросов
с языка Python на язык SQL""", 
"""Механизм для генерации 
случайных данных в Django"""],
                "correct_option": 2,
                "fact_text": "Правильный ответ: С базами данных Django общается через инструмент Django ORM (англ. Object-Relational Mapping, «объектно-реляционное отображение»). Это «переводчик» с языка Python на язык SQL, понятный большинству баз данных."
            },
        ]